export const AuthorizedRoles = ['admin', 'superadmin'];
export const EnterpriseRole = [...AuthorizedRoles, 'enterprise'];
export const PremiumRole = [...EnterpriseRole, 'premium'];
export const ProRole = [...PremiumRole, 'pro'];
export const DefaultRoles = ['user'];

export const questions = [
  {
    id: 1,
    question:
      'Анги руу ормогц багш хичээлээ самбар дүүрэн ярайтал бичиж, зурсан байлаа. <br /> Юуг хамгийн түрүүнд анзаарах вэ?',
    options: [
      { value: 1, label: 'Гоё зураг, схем, хүснэгт, өнгө өнгийн шохой' },
      { value: 2, label: 'Багшийн дууны өнгө, ритм, ярих арга' },
      { value: 3, label: 'Бичмэл тайлбар, сэдвийн гарчиг, бүлгүүд, унших материал' },
      {
        value: 4,
        label:
          '“Шууд бодлого бодуулаад, жишээн дээр ажиллавал л сайн ойлгоно доо…” гэж дотроо бодно',
      },
    ],
  },
  {
    id: 2,
    question:
      'Эхний сэдэв дээр багш хурдан яриад эхлэв. <br /> Сайн ойлгохын тулд юуг нэмэлтээр хүсэх вэ?',
    options: [
      { value: 1, label: 'Схем, диаграм, жишээ зураг харах' },
      { value: 2, label: 'Илүү тайван, аман жишээ, түүх ярихыг сонсох' },
      { value: 3, label: 'Дэлгэрэнгүй бичмэл тайлбар, гарын авлага авах' },
      { value: 4, label: 'Шууд даалгавар, бодлого авч, өөрөө оролдож үзэх' },
    ],
  },
  {
    id: 3,
    question:
      'Дараагийн өдөр шинэ томьёонууд гарч ирэв. <br /> Толгой бага зэрэг эргэлээ. Сайн найз нь шоолоод байв. Томьёог яаж цээжлээд найзынхаа амыг таглах вэ?',
    options: [
      {
        value: 1,
        label: 'Томьёог зураг, дүрслэл, схем болгон төсөөлнө',
      },
      { value: 2, label: 'Чангаар, хэмнэлтэй, дуу шиг давтана' },
      { value: 3, label: 'Олон удаа бичиж, уншиж, дахин уншина' },
      { value: 4, label: 'Бодлого бодохдоо ашиглаж, гараараа бичиж, ашиглаж байж тогтооно' },
    ],
  },
  {
    id: 4,
    question:
      'Завсарлагаанаар найзтайгаа сургуулийн коридорт юм идэж байтал нөгөө ангид шинээр шилжиж ирсэн сурагчтай тааралдав. Үнэхээр хөөрхөн байлаа. <br />  Маргааш нь түүнийг юугаар нь эргэж санах вэ?',
    options: [
      { value: 1, label: 'Нүүр царай, үс, хувцас, орчны дүр зураг' },
      { value: 2, label: 'Дуу хоолой, хэлсэн нэг өгүүлбэр, инээд' },
      { value: 3, label: 'Нэр нь бичгээр харагдсан байдал (фэйсбүүк нэр, нэрийн тэмдэг)' },
      { value: 4, label: 'Хаана, юу хийж байхдаа уулзсан нөхцөл байдал' },
    ],
  },
  {
    id: 5,
    question:
      'Түүнийг крашлаж (шохоорхох) эхэлсэн бөгөөд дахиж харах гээд нэлээн хөгшин багшийн хичээл дээр сууж байна. <br /> Уйтгартай хичээл дээр автомат ямар үйлдэл гардаг вэ?',
    options: [
      { value: 1, label: 'Дэвтэр дээрээ ноорог зураг, хайрцаг, жижиг схем зурж эхэлнэ' },
      { value: 2, label: 'Багшийн хоолойн өнгө, сул үгс, ярианаас хадуурсныг нь сонсож суудаг' },
      { value: 3, label: 'Тэмдэглэлээ дахин цэгцэлж, цэвэрхэн дээр нь шилжүүлж бичдэг' },
      { value: 4, label: 'Хөл гар, үзэг, сандал – ер нь ямар нэг юм оролдон хөдөлж эхэлдэг' },
    ],
  },
  {
    id: 6,
    question:
      'Сайн найз нь тэтгэлэгт бэлддэг онлайн дугуйланд цуг бүртгүүлье гэж санал болгов. <br /> Ямар дугуйлан байвал таалагдах вэ?',
    options: [
      { value: 1, label: 'Инфографик, визуал слайд, схем дүүрэн' },
      { value: 2, label: 'Видео тайлбар, лекц нь сайн' },
      { value: 3, label: 'Унших материал, pdf, нийтлэлээр баялаг' },
      { value: 4, label: 'Төсөл, бодит даалгавар, дасгал ажил ихтэй' },
    ],
  },
  {
    id: 7,
    question:
      'Дамжаанд бүртгүүлээд апп татаж авах ёстой болов. <br /> Шинэ апп-аа яаж ашиглаж сурах вэ?',
    options: [
      { value: 1, label: 'Screenshot, зурган заавар, icon-уудыг нь харна' },
      { value: 2, label: 'Видео/аман заавар үзэж сонсоно' },
      { value: 3, label: 'Бичсэн асуулт хариулт (FAQ), хөтөч текст, пост уншина' },
      { value: 4, label: 'Шууд нээгээд товшоод, өөрөө туршиж эхэлнэ' },
    ],
  },
  {
    id: 8,
    question:
      'Эхний live хичээл дууссаны дараа багш их даалгавар өглөө. Найз нь: “За, орой хамтдаа сууж хийцгээе, Video call-р холбогдъё” гэдэг. <br /> Дотроо ямар шийдвэр гаргах магадлал өндөр вэ?',
    options: [
      {
        value: 1,
        label:
          '“Эхлээд би өөрөө ганцаараа сууж үзье, болохгүй бол сүүлд нь хамт сууцгаая” гэж бодно',
      },
      {
        value: 2,
        label:
          '“Богинохон ганцаараа үзээд, дараа нь найзтайгаа орж асуух хэсгүүдээ ярья” гэж бодно',
      },
      {
        value: 3,
        label:
          '“Анхнаасаа л хамт сууж, ярилцаж байж хийсэн нь дээр, ганцаараа суух дургүй” гэж бодно',
      },
    ],
  },
  {
    id: 9,
    question:
      'Тэгтэл крашаас “шинээр нээгдсэн кофе шоп-д сууж хамт хичээлээ хийе” гэсэн чат ирсэн байв. Гэтэл байршлыг нь мэддэггүй. <br /> Яаж зам заалгавал ойлгоход амар вэ?',
    options: [
      { value: 1, label: 'Газрын зураг, Google Maps screenshot' },
      { value: 2, label: 'Аман чиглэл: “эндээс гараад, баруун тийш, дараа нь…”' },
      { value: 3, label: 'Messenger-ээр алхам алхмаар бичсэн заавар' },
      { value: 4, label: '“За яваад үзье, газар дээр нь очоод олчихно” гэдэг' },
    ],
  },
  {
    id: 10,
    question:
      'Краштайгаа хамт хичээлээ давтдаг болсон бөгөөд бүүр англи хэлний сургалтад хамт явж эхлэв. Эхний өдөр нь үг цээжлэх даалгавар өгөв. <br /> Хамгийн үр дүнтэй арга нь аль вэ?',
    options: [
      { value: 1, label: 'Үг бүрийг нэг тодорхой зурагтай холбох (visual)' },
      { value: 2, label: 'Харилцан яриа, аудио бичлэгээр сонсож, давтаж хэлэх' },
      { value: 3, label: 'Бичиж, доор нь жишээ өгүүлбэр унших' },
      { value: 4, label: 'Бодит ярианд, амьдралдаа хэрэглэж үзэх' },
    ],
  },
  {
    id: 11,
    question:
      'Сургалт дээр нэг өдөр хосоороо ажиллах дасгал хийлгэсэн бөгөөд сурагчдыг суудлаа сэлгэж болно гэлээ. <br /> Ямар байдлаар сурахыг нь илүүд үзэх байна вэ?',
    options: [
      {
        value: 1,
        label: '“Ярианы дасгал ч бай, би эхлээд дүрэм, үгээ ганцаараа цэгцэлнэ.”',
      },
      {
        value: 2,
        label:
          '“Зарим дасгалыг ганцаараа, заримыг нь хэн нэгэнтэй (краштайгаа) ээлжилж хийвэл зүгээр”',
      },
      {
        value: 3,
        label: '“Аль болох өөр хүнтэй, бүр боломж гарвал краштайгаа баг болмоор санагдана”',
      },
    ],
  },
  {
    id: 12,
    question:
      'Хичээл дээрээ сурах бичгээ нээгээд хартал баахан хүснэгт, график байлаа. <br /> Юуг нь түрүүлж харах вэ?',
    options: [
      { value: 1, label: 'Өнгөөр ялгасан багана, шугам, дүрслэл' },
      { value: 2, label: 'Хэн нэгэн тэднийг ярьж тайлбарлахыг дотроо хүлээнэ' },
      { value: 3, label: 'Доор нь бичсэн тайлбар, тайлбарласан текст' },
      { value: 4, label: 'Өгөгдлийг шууд ашиглаад бодлого бодож үзэх хэсгийг' },
    ],
  },
  {
    id: 13,
    question:
      'Дугуйлангаас нь 3 хүний багийн ажил өглөө: чи, сайн найз чинь, дээрээс нь танихгүй хүн. <br /> Багийн ажлаа яаж хийх вэ?',
    options: [
      {
        value: 1,
        label: 'Ажлынхаа ихэнх хэсгийг өөртөө авч ганцаараа хийчхээд дараа нь хуваалцана',
      },
      {
        value: 2,
        label:
          'Гол хэсгийг өөрөө бэлтгээд, чухал шийдвэр, танилцуулгыг багаараа ярилцаж байж хийнэ',
      },
      {
        value: 3,
        label:
          'Эхнээс нь дуустал хамт уулзаж, видео дуудлага, чатаар бүгдээрээ зэрэг, хамтдаа хийнэ.',
      },
    ],
  },
  {
    id: 14,
    question:
      'Краш нь хамтдаа шинэ ур чадвар — спорт, хөгжим, бүжиг суръя гэж санал болгоно. <br /> Яаж сурахыг илүүд үзэх вэ?',
    options: [
      { value: 1, label: 'Нэг хөдөлгөөнийг удаан, тод харуулсан видео үзэх' },
      { value: 2, label: 'Дасгалжуулагч/багшийн аман зааврыг сонсох' },
      { value: 3, label: 'Алхам алхмаар бичсэн заавар унших' },
      { value: 4, label: 'Шууд дагаж хийж, биеэрээ туршиж үзэх' },
    ],
  },
  {
    id: 15,
    question:
      'Онлайн дугуйлан нь томьёо, дүрэм зөндөө их цээжлүүлнэ. <br /> Яаж цээжилбэл сайн тогтоох вэ?',
    options: [
      { value: 1, label: 'Өнгөөр ялгаж, хайрцаглаад харах' },
      { value: 2, label: 'Чангаар хэлж, хэмнэлтэйгээр давтах' },
      { value: 3, label: 'Олон удаа бичиж, уншиж тогтоох' },
      { value: 4, label: 'Олон бодлого, дасгал дээр ашиглаж тогтоох' },
    ],
  },
  {
    id: 16,
    question:
      'Краш нь сургалтдаа хоёр удаа очоогүй бөгөөд хичээлээ нөхөх гээд дэвтрээ өгөөч гэж гуйв. <br /> Таны дэвтрийг гүйлгэж харахад ямар байх бол?',
    options: [
      { value: 1, label: 'Өнгөөр ялгаж, сум, схем, зураглал ихтэй' },
      { value: 2, label: 'Бичсэн зүйл багатай, голчлон сонсож, зарим түлхүүр үг л тэмдэглэдэг' },
      { value: 3, label: 'Гарчиг, дэд гарчигтай, логиктой бичмэл тэмдэглэл' },
      { value: 4, label: 'Бодлого, алхам алхмаар жишээ, кейс их бичсэн' },
    ],
  },
  {
    id: 17,
    question:
      'Хэлний сургалт 3 сар үргэлжиллээ. Урам хөөр жаахан буурч, өдөр болгон явахад залхуутай болж эхлэв. <br /> Гэхдээ хэлээ үнэхээр сайжруулж бас крашаа орхихгүйн тулд юу хийх вэ?',
    options: [
      {
        value: 1,
        label:
          'Өөрийн хувийн төлөвлөгөө, дэвтрээ ашиглаад, ганцаараа зорилго, ахиц дүгнэлтээ хянах',
      },
      {
        value: 2,
        label:
          'Хувийн төлөвлөгөөгөө барина, дээрээс нь 7 хоногт 1–2 удаа краш эсвэл багштайгаа ахицынхаа талаар ярьж тодруулна',
      },
      {
        value: 3,
        label:
          'Сургалтынхантайгаа тогтмол чат, уулзалт хийх, хамт яваа хүмүүс, багийн уур амьсгалыг сайжруулах',
      },
    ],
  },
  {
    id: 18,
    question:
      'Хичээлээс гадуур онлайн дугуйланнд болон англи хэлний сургалтад гээд аль алиныг нь амжуулах бага зэрэг дарамттай болж эхлэв. <br /> Асуудыг шийдвэрлэхийн тулд юу хийх вэ?',
    options: [
      {
        value: 1,
        label: 'Асуудлыг жижиг хэсгүүдэд хувааж, шалтгаан–үр дагаврыг зураг, схемээр зурах',
      },
      {
        value: 2,
        label:
          'Өөртэйгөө эсвэл сайн найз, краштайгаа ярилцаж, бүх хувилбаруудыг амаар хэлж тооцоолох',
      },
      { value: 3, label: 'Давуу/сул тал, сонголтуудаа бичиж, цаасан дээр харьцуулах' },
      {
        value: 4,
        label:
          'Нэг жижиг туршилт хийж үзэх (жишээ нь, 7 хоног өөр хуваарь турших, 1 сар өөр төлөвлөгөө дагах)',
      },
    ],
  },
  {
    id: 19,
    question:
      'Ингэж явсаар англи хэлний сургалтын түвшин ахиулах шалгалт ойртов. Хэрэв унавал ганцаараа хуучин ангидаа үлдэх бөгөөд тэнцвэл краштайгаа хамт дараагийн түвшинд цуг сурна. <br /> Яаж бэлдэх вэ?',
    options: [
      { value: 1, label: 'Сэдэв бүрийг схем, оюуны зураг (mind map) болгоод харах' },
      { value: 2, label: 'Өөртэйгөө эсвэл хүнтэй ярилцах (краштайгаа)' },
      { value: 3, label: 'Дэвтэр, номоо уншаад асуулт–хариулт хэлбэрээр цэгцлэх' },
      { value: 4, label: 'Жинхэнэ тест, бодит жишээн дээр давтах' },
    ],
  },
  {
    id: 20,
    question:
      'Онлайн дугуйланны шалгалтын өдөр. Найзтайгаа хамт тэтгэлэг авах уу, мөнгөө хийсгэсэн болж таарах уу гэдгийг шийдэх мөч 10 минутын дараа эхэлнэ. <br /> Энэ 10 минутыг яаж өнгөрөөх нь танд хамгийн зөв санагдах вэ?',
    options: [
      {
        value: 1,
        label: 'Өмнө нь зурсан 1–2 том схем, оюуны зураг (mind map)-аа хурдхан хараад авна',
      },
      { value: 2, label: 'Гол томьёо, гол санаануудыг аяархан эсвэл чангаар давтаж хэлнэ' },
      { value: 3, label: 'Хураангуй, түлхүүр үгс, томьёоны жагсаалтыг нэг гүйлгээд үзнэ' },
      {
        value: 4,
        label:
          'Богино 1–2 бодлого/жишээг сүүлчийн удаа бодож, “толгойдоо хийж авсан” гэдгийг мэдэрнэ',
      },
    ],
  },
];
